app/controllers/patients_controller.rb

  def index
    if current_user[:isadmin]
      @patients = Patient.all.order(id: :desc).page(params[:page]).per(10)
---
SELECT  "patients".* FROM "patients"  ORDER BY "patients"."id" DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "patients"

  def search
    gender = params[:gender]
    location = params[:location]
    topic = params[:topic]
    duration = params[:duration]
    type = params[:type]
    computer = params[:computer]

    if (params.has_key?(:fromdate) &&   !params[:fromdate].blank?)
      fromdate = Date.strptime(params[:fromdate], "%m/%d/%Y").to_s(:db)
    else
      fromdate = Date.strptime('01/01/1970', "%m/%d/%Y").to_s(:db)
    end

    if (params.has_key?(:todate) && !params[:todate].blank?)
      todate = Date.strptime(params[:todate], "%m/%d/%Y").to_s(:db)
    else
      todate = Date.strptime('12/31/2100', "%m/%d/%Y").to_s(:db)
    end
      @patients = Patient.where("gender LIKE ? AND  location LIKE ? AND topicdiscussed LIKE ? AND timelength LIKE ? AND noofparticipant LIKE ? AND computer LIKE ? AND startdate >= ? AND startdate <= ?","%#{gender}%","%#{location}%","%#{topic}%","%#{duration}%","%#{type}%","%#{computer}%","%#{fromdate}%","%#{todate}%").order(id: :desc).page(params[:page]).per(10)
---
SELECT  "patients".* FROM "patients" WHERE (gender LIKE '%%' AND  location LIKE '%%' AND topicdiscussed LIKE '%%' AND timelength LIKE '%%' AND noofparticipant LIKE '%%' AND computer LIKE '%%' AND startdate >= '%1970-01-01%' AND startdate <= '%2100-12-31%')  ORDER BY "patients"."id" DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "patients" WHERE (gender LIKE '%%' AND  location LIKE '%%' AND topicdiscussed LIKE '%%' AND timelength LIKE '%%' AND noofparticipant LIKE '%%' AND computer LIKE '%%' AND startdate >= '%1970-01-01%' AND startdate <= '%2100-12-31%')

  def export
    @patients = Patient.all.order(id: :desc)
---
SELECT "patients".* FROM "patients"  ORDER BY "patients"."id" DESC

  def bulkcreate
    if current_user[:isadmin]
      @patients = Patient.all.last(10).reverse
---
SELECT  "patients".* FROM "patients"  ORDER BY "patients"."id" DESC LIMIT 10

  def create
    if create_params[:startdate]!=''
      startdate = Date.strptime(create_params[:startdate], "%m/%d/%Y")
    end
      @patient = Patient.create(userid: create_params[:userid], startdate: startdate, starttime: create_params[:starttime], initialcontact: create_params[:initialcontact], agerange: create_params[:agerange], gender: create_params[:gender], languagespeaking: create_params[:languagespeaking], languagereading: create_params[:languagereading], computer: create_params[:computer], computerskills: create_params[:computerskills], topicdiscussed: create_params[:topicdiscussed],  timelength: create_params[:timelength], notes: create_params[:notes], noofparticipant: create_params[:noofparticipant], noofinteraction: create_params[:noofinteraction], location: create_params[:location])
---
INSERT INTO "patients" ("userid", "startdate", "starttime", "initialcontact", "agerange", "gender", "languagespeaking", "languagereading", "computer", "computerskills", "topicdiscussed", "timelength", "notes", "noofparticipant", "noofinteraction", "location") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"

  def show
    @patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT 1  [["id", 13]]

  def edit
    @patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT 1  [["id", 13]]